app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?) RETURNING "id"  [["created_at", "2023-11-20 00:41:09.869748"], ["updated_at", "2023-11-20 00:41:09.869748"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["product_id", 3], ["cart_id", 1], ["created_at", "2023-11-20 00:41:09.944422"], ["updated_at", "2023-11-20 00:41:09.944422"]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.line_items.build(product: product)

    respond_to do |format|
      if @line_item.save