app/controllers/concerns/current_cart.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?) RETURNING "id"  [["created_at", "2023-11-20 00:41:09.869748"], ["updated_at", "2023-11-20 00:41:09.869748"]]
---
  def set_cart
    @cart = Cart.find(session[:card_id])
  rescue ActiveRecord::RecordNotFound
    @cart = Cart.create